In [5]:
import pandas as pd
pd.Series?

In [6]:
animals = ["Ajay", "Rushikesh", "Ajit"]
pd.Series(animals)

0         Ajay
1    Rushikesh
2         Ajit
dtype: object

In [7]:
numbers = [1, 2, 3]
pd.Series(numbers)

0    1
1    2
2    3
dtype: int64

In [8]:
animals = ["Ajay", "Ajit", None]
pd.Series(animals)

0    Ajay
1    Ajit
2    None
dtype: object

In [9]:
numbers = [1, 2, None]
pd.Series(numbers)

0    1.0
1    2.0
2    NaN
dtype: float64

In [10]:
import numpy as np
np.nan == None

False

In [11]:
np.nan == np.nan

False

In [12]:
np.isnan(np.nan)

True

In [16]:
sports = {'Archery' : 'Bhutan',
         'Golf' : 'Scotland',
          'Sumo' : "Japan",
         'Taekwondo' : 'South Korea'}
s = pd.Series(sports)
s

Archery           Bhutan
Golf            Scotland
Sumo               Japan
Taekwondo    South Korea
dtype: object

In [17]:
s.index

Index(['Archery', 'Golf', 'Sumo', 'Taekwondo'], dtype='object')

In [18]:
s = pd.Series(['Tiger', 'Bear', 'Moose'], index = ['India', 'America', 'Canada'])
s

India      Tiger
America     Bear
Canada     Moose
dtype: object

In [19]:
dict1 = {
        "name" : ['harry', 'rohan', 'skill', 'shubh'],
        "marks" : [92, 34,24, 17],
        "city" : ['rampur', 'kolkata', 'bareilly', 'antarctica']
}

In [20]:
df = pd.DataFrame(dict1)

In [21]:
df

    name  marks        city
0  harry     92      rampur
1  rohan     34     kolkata
2  skill     24    bareilly
3  shubh     17  antarctica

In [22]:
df.to_csv('friends.csv')

In [23]:
df.to_csv('friends_index_false.csv',index = False)

In [24]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [25]:
df.tail(2)

    name  marks        city
2  skill     24    bareilly
3  shubh     17  antarctica

In [26]:
df.head()

    name  marks        city
0  harry     92      rampur
1  rohan     34     kolkata
2  skill     24    bareilly
3  shubh     17  antarctica

In [27]:
df.tail()

    name  marks        city
0  harry     92      rampur
1  rohan     34     kolkata
2  skill     24    bareilly
3  shubh     17  antarctica

In [28]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000